import React from 'react';

const PrivacyPolicy = () => {
  return (
    <div className="p-20">
      <h3>سیاست حریم خصوصی - LemonCare</h3>
      <p>
        LemonCare به حریم خصوصی کاربران خود اهمیت می‌دهد و متعهد است که اطلاعات
        شخصی شما را محافظت کند. این سیاست توضیح می‌دهد که چه اطلاعاتی را
        جمع‌آوری می‌کنیم، چگونه از آن‌ها استفاده می‌کنیم، و چگونه از اطلاعات شما
        محافظت می‌کنیم.
      </p>
      <h4>۱. اطلاعات شخصی</h4>
      <p>
        برای ارائه خدماتی امن و مناسب، ممکن است اطلاعاتی شامل نام، آدرس ایمیل،
        شماره تماس و آدرس پستی شما را در هنگام ثبت‌نام و یا ثبت سفارش دریافت
        کنیم. این اطلاعات برای پردازش و ارسال سفارش شما و همچنین بهبود تجربه
        کاربری جمع‌آوری می‌شوند. کاربران می‌توانند اطلاعات خود را از طریق
        پروفایل خود ویرایش و مدیریت کنند.
      </p>
      <h4>۲. استفاده از کوکی‌ها</h4>
      <p>
        LemonCare از کوکی‌ها برای بهبود تجربه کاربری شما استفاده می‌کند. کوکی‌ها
        فایل‌های کوچکی هستند که در مرورگر شما ذخیره می‌شوند و به ما کمک می‌کنند
        تا تنظیمات و فعالیت‌های شما را بهتر بشناسیم. شما می‌توانید تنظیمات کوکی
        را از طریق مرورگر خود تغییر دهید و در صورت تمایل، آن‌ها را غیرفعال کنید.
      </p>
      <h4>۳. امنیت اطلاعات</h4>
      <p>
        LemonCare تمام تلاش خود را برای حفاظت از اطلاعات کاربران به کار می‌گیرد
        و با استفاده از پروتکل‌ها و لایه‌های امنیتی مناسب، از دسترسی‌های غیرمجاز
        به داده‌ها جلوگیری می‌کند. تنها کارمندانی که برای انجام وظایف خود به
        اطلاعات شما نیاز دارند، به آن‌ها دسترسی خواهند داشت.
      </p>
      <h4>۴. اشتراک‌گذاری داده‌ها</h4>
      <p>
        LemonCare اطلاعات شما را با هیچ فرد یا سازمان دیگری به اشتراک نمی‌گذارد،
        مگر در صورت دریافت مجوز از شما یا دستور قانونی.
      </p>
      <h4>۵. ارتباطات تبلیغاتی</h4>
      <p>
        در صورت موافقت کاربران، ممکن است برای اطلاع‌رسانی درباره خدمات،
        تخفیف‌ها، و محصولات جدید، ایمیل یا پیامک‌های تبلیغاتی ارسال کنیم. در
        صورتی که تمایلی به دریافت این پیام‌ها نداشته باشید، می‌توانید از طریق
        پروفایل کاربری خود لغو اشتراک کنید.
      </p>
      <h4>۶. حقوق کاربران</h4>
      <p>
        شما به اطلاعات شخصی خود دسترسی کامل دارید و می‌توانید در هر زمان آن‌ها
        را مشاهده، ویرایش یا حذف کنید. در صورتی که سوالی درباره این سیاست حریم
        خصوصی داشته باشید، می‌توانید با تیم پشتیبانی ما در تماس باشید.
      </p>
      <h3>تماس با ما</h3>
      <p>
        در صورت نیاز به پشتیبانی یا اطلاعات بیشتر، لطفاً با ایمیل{' '}
        <a href="mailto:info@lemoncare.com">info@lemoncare.com</a> تماس بگیرید.
      </p>
    </div>
  );
};

export default PrivacyPolicy;
